[
    {
        "en": [
            {
                "post":[
                    {"id": 1,"title":"MH370: Where are you?", "subTitle":"One of the biggest mysteries in the flight-world", "reference":"Wikipedia", "picTwo":"mh370bTwo.jpg", "pic":"mh370b.jpg",
                     "content":"Malaysia Airlines Flight 370 (also referred to as MH370 or MAS370) was a scheduled international passenger flight operated by Malaysia Airlines that disappeared on 8 March 2014 while flying from Kuala Lumpur International Airport to its destination, Beijing Capital International Airport. <br> The crew of the Boeing 777-200ER aircraft last communicated with air traffic control (ATC) around 38 minutes after takeoff when the flight was over the South China Sea. The aircraft was lost from ATC radar screens minutes later, but was tracked by military radar for another hour, deviating westwards from its planned flight path, crossing the Malay Peninsula and Andaman Sea. <br> It left radar range 200 nautical miles (370 km) northwest of Penang Island in northwestern Malaysia. With all 227 passengers and 12 crew aboard presumed dead, the disappearance of Flight 370 was the deadliest incident involving a Boeing 777 and the deadliest in Malaysia Airlines' history, until it was surpassed in both regards by Malaysia Airlines Flight 17 that was shot down while flying over eastern Ukraine, four months later. The combined loss caused significant financial problems for Malaysia Airlines, which was renationalized by the Malaysian government in December 2014.  <br> The search for the missing airplane, which became the most costly in aviation history, focused initially on the South China and Andaman seas, before analysis of the aircraft's automated communications with an Inmarsat satellite identified a possible crash site somewhere in the southern Indian Ocean. <br> The lack of official information in the days immediately after the disappearance prompted fierce criticism from the Chinese public, particularly from relatives of the passengers; most people on board Flight 370 were of Chinese origin. Several pieces of marine debris confirmed to be from the aircraft washed ashore in the western Indian Ocean during 2015 and 2016. <br> After a three-year search across 120,000 square kilometres (46,000 sq mi) of ocean failed to locate the aircraft, the Joint Agency Coordination Centre heading the operation suspended their activities in January 2017. A second search launched in January 2018 by the private contractor Ocean Infinity also ended without success after six months.",
                     "date":"August 2019"},
                    {"id": 2, "title":"Mr. Snooker", "subTitle":"Ronnie O'Sullivan the GOAT", "reference":"Wikipedia", "picTwo":"ronnieTwo.jpg", "pic":"ronnie.jpg", "content":"Ronald Antonio O'Sullivan OBE (born 5 December 1975) is an English professional snooker player who is widely regarded as one of the greatest players in the history of the sport. He has won five World Championships, a record seven Masters titles, and a record seven UK Championships, setting a record total of 19 titles in Triple Crown tournaments. <br>On winning the 1993 UK Championship at the age of 17 years and 358 days, he became the youngest player ever to win a ranking title; he now shares the record for the most ranking titles (36) with Stephen Hendry. <br> He is also the youngest winner of the Masters tournament, winning the 1995 event aged 19 years old. His career prize money of over £10 million is the highest amount earned by any player in snooker history. <br>A prolific break-builder, he holds the record for the most century breaks in professional competition and is the only player ever to have achieved 1,000 career centuries. He also holds the records for the highest number of officially recognised maximum breaks in professional competition (15), and for the fastest competitive maximum break, compiled in a time of 5 minutes and 8 seconds at the 1997 World Championship. <br>O'Sullivan has often been a controversial figure in the sport, noted for his unpredictable temperament and his struggles with alcohol, drugs, and depression, and has received many warnings and sanctions from the sport's governing body over his conduct and comments. <br>He took a prolonged break from the sport during the 2012/2013 season and has repeatedly indicated his intention to retire. In late 2018, he threatened to form a breakaway snooker tour.<br> Outside his playing career, he has worked as a pundit for Eurosport's snooker coverage, has written crime novels and autobiographies, and has starred in the miniseries Ronnie O'Sullivan's American Hustle. He was awarded an OBE in the 2016 New Year Honours.", "date":"August 2019"},
                    {"id": 3, "title":"Why Open-Source?", "subTitle":"Is this the way to go", "reference":"Article by Brian", "picTwo":"opensourceTwo.jpg", "pic":"opensource.jpg", "content":"<b> Disclaimer: </b> My opinion is, if open-source technology was not in existence, the programmer population would be half of what we are today. <br> Open source came at a time when the need for more technological solutions came into play. From mobile gadgets to robots. <br>  Back in the early 21st Century programming materials were so expensive. To become a programmer you had to buy a computer, pay for computer software meant to run the computer, pay for the programming software, buy huge books and even at times pay coding tutors. Nowadays all you need is a computer and internet connectivity.  <br>  According to me Internet is an open source tool though in a bit complex way. Why? You can use the tool without having to purchase it and you have the platform to improve it if capable. <br>  Open source tools have resulted in more collaboration when coming up with solutions. The quality of the end product becomes better and better with time. Sharing of code has also improved code quality. With GIT in play, every programmer wants a share of the platform. <br>  Quite a big number of companies would rather implement Linux system than Windows, why? <br> Open source technology is not prone to major hacking attacks as compared to proprietary code. This is due to the fact that there are so many versions of one particular open source tool that keep getting updated almost on a daily basis, which makes it hard for any hacker to keep up with the pace. <br> For any open source tool to be considered up to standard, then there has to be a community behind it which will maintain the code regularly.", "date":"August 2019"},
                    {"id": 4, "title":"SDMX", "subTitle":"Big data is currently the big thing", "reference":"Article by Brian", "picTwo":"sdmxTwo.jpg", "pic":"sdmx.jpg", "content":"Big data is a shift of focus in the technology world. Back in the days focus was not on data rather than functionality of a system and communication. Nowadays any company, large or small is focused on manipulating data available to offer better solutions. <br> The more the data, the more accurate a solution is to a certain problem. This collection of large datasets brought in the essence of sharing information among companies. <br> Example; Facebook would like to know how many countries have internet connectivity. Instead of doing the survey themselves, they can take data from a company that has already done that survey and use it to meet their objectives. <br> This sharing of data resulted to two major data formats called JSON and XML. Any company can use either but the problem is that the data structure will be different for each company. <br> This is not efficient if you want to get information from over 10 countries as you must study their structure before implementing each different, hence the need for a standard structure and that is SDMX. <br> It has been existence for about 20 years now but recently it is gaining momentum due to its demand. Any data scientist who wants to be relevant in the next 15 years must be able to use SDMX.", "date":"August 2019"},
                    {"id": 5, "title":"Warren Buffet", "subTitle":"Best money-maker in the world", "reference":"Article by Brian", "picTwo":"warrenTwo.jpg", "pic":"warrenbuffet.jpg", "content":"I consider him the best money –maker in the world. He started small in the 80s by staking his money on the so called small companies at those times. <br>Today those small companies are dollar billion companies in the world which include Coca-Cola, American Airlines, MasterCard, Amazon, Visa, Wells Fargo, Verizon, Delta Airlines and Phillips among many others. <br>His standard of living has not changed. Same old car, same old 5-bedroom house he bought in 1956, no bodyguards and a small office inside his house. His source of wealth is as a result of the risk he took in trusting the future will get better. Indeed today he can smile. <br>Recently when interrogated he said that he regrets not starting to invest earlier than he started. Funny thing though because he started as early as 11 years old by purchasing stocks and even earning more than most of his teachers at the time. <br> He was rejected by Harvard Business School due to his appearance at the time and not on the basis of his mind capability.  His idol was Benjamin Graham, but Graham rejected giving Warren a job because Warren wasn’t a Jew.<br> Finally one fascinating thing about him is he has escaped technology all his life. He has sent only one email to one Jeff Raikes of Microsoft. <br>His office doesn’t have a computer and he would rather keep reading books than looking at a computer.", "date":"August 2019"},
                    {"id": 6, "title":"OOP vs Functional vs Procedural", "subTitle":"Every coder must know these concepts", "reference":"Article by Brian", "picTwo":"oopTwo.jpg", "pic":"oop2.jpg", "content":"They are concepts every programmer will talk about. They have been there for quite a long time. All programmers have a different opinion about which is the best concept to use. Each opinion is valid depending on the goal to be achieved. <br> Bottom line is, among the three you have to use at least one of them in coming up with a system, doesn’t matter the programming language you are going to use. Yes these are concepts but more of code structure. <br> Why are they important? They give a clear flow of how system components have been integrated in the code to allow addition, subtraction or debugging of system entities. <br> JavaScript is considered the easiest language to learn because you can implement either of the concepts without any hassle. That’s why it is referred to as an agnostic language. Object Oriented Programming languages include Java, C++, Python and Visual Basic among others. <br> All these approaches have their own advantages and disadvantages based on encapsulation, code complexity, polymorphism, inheritance and abstraction.<br> When developing solutions integration of these concepts can be done but with caution hence it is upon the programmer to come up with the most understandable and debug efficient code structure.", "date":"August 2019"},
                    {"id": 7, "title":"Didier Drogba", "subTitle":"Who is he?", "reference":"Article by Brian", "picTwo":"didierTwo.jpg", "pic":"didierdrogba.jpg", "content":"Born on March 11 1978, I consider him one of my personal best players I’ve ever watched playing. The first time I got to know him was back in my lower primary school. <br>When he scored in the 2005 Chelsea winning title final game, the following day in school I told my friends about him, but because I couldn’t remember his name, I referred to him as Dragon.<br>That name stuck for about one week until I read the Sunday gazette and his name became clear. Drogba Didier, shirt number 11 (DD11). Mourinho regarded him as his son. I can’t forget when Rafael Benitez (Liverpool coach at the time) talked ill of Didier Drogba.<br>The following game against Liverpool, Drogba scored a hat-trick, shutting his mouth. He was a beast against Arsenal (12 appearances, 13 goals, 4 assists). <br>Mourinho once said, if you have Drogba in your team as a coach, you can pack the bus and leave Drogba to fight with the opponents defenders alone. Any slight turn with the ball is a half scoring chance for him.<br>One last thing, my mom supports Chelsea coz of Drogba. That’s the only player she knows. She doesn’t even know he retired hahaha.", "date":"August 2019"}
                ]
            }
        ],
        "es": [
            {
                "post":[
                    {"id": 1, "title":"MH370: ¿Dónde estás?", "subTitle":"Uno de los mayores misterios del mundo del vuelo.", "reference":"Wikipedia", "picTwo":"mh370bTwo.jpg", "pic":"mh370b.jpg", "content":"El vuelo 370 de Malaysia Airlines (MH370/MAS370, también designado en virtud de un acuerdo de código compartido como vuelo 748 de China Southern Airlines (CZ748/CSN748)),  fue un vuelo internacional regular de pasajeros desaparecido el 8 de marzo de 2014, operado por un Boeing 777-200 donde viajaban 239 personas (227 pasajeros y 12 tripulantes). <br> Desde el momento en que se perdió contacto con el avión, se inició y desarrolló una operación de búsqueda y rescate que ha sido considerada la más larga de la historia,  así como 'una de las operaciones de investigación y búsqueda más difíciles y costosas de la historia de la aviación'. <br> Tras varias semanas de búsqueda en aguas del golfo de Tailandia y sus alrededores, donde se presuponía habría caído el avión, nuevas pistas indicaron que el avión había seguido rumbo al Sur adentrándose en el océano Índico lejos de tierra firme, tanto la ubicación de los restos del avión como las causas del accidente siguen siendo desconocidas. <br> El hecho de que la ubicación de este avión y sus ocupantes permaneciese desconocida después de casi cuatro semanas de intensa búsqueda, fue calificado por algunos medios de comunicación de 'suceso sin precedentes en la aviación moderna', como 'uno de los mayores misterios de la historia de la aviación', o 'el mayor misterio de la aviación civil de la historia'.<br> Igualmente el primer ministro australiano, Tony Abbott, afirmó que la búsqueda del MH370 era la 'más difícil en la historia de la humanidad'.", "date":"August 2019"},
                    {"id": 2, "title":"Señor Snooker", "subTitle":"Ronnie O'Sullivan el GOAT", "reference":"Wikipedia", "picTwo":"ronnieTwo.jpg", "pic":"ronnie.jpg", "content":"Ronald Antonio 'Ronnie' O'Sullivan (Wordsley, Inglaterra; 5 de diciembre de 1975) es un jugador profesional de snooker inglés. Es apodado The Rocket (El cohete) debido a la velocidad de su estilo de juego. Tiene otros apodos como The Essex Exocet (El misil de Essex). <br> Ha sido campeón del mundo en cinco ocasiones. Ganó los títulos en los años: (2001, 2004, 2008, 2012 y 2013), siendo uno de los tres jugadores capaces de revalidar el título de manera consecutiva en el Crucible Theatre(el Campeonato del Mundo se juega allí desde 1977) junto a Steve Davis y Stephen Hendry. <br>Es el segundo en todos los tiempos que más premios en metálico ha ganado, con ganancias en su carrera de más de 9 millones de libras, solo por detrás de Stephen Hendry. O'Sullivan ha sido el número uno del ranking mundial en cinco ocasiones. Ha ganado un total de 36 títulos de ranking, y es el primero que más centenas ha hecho en competición en el Crucible Theatre, 131. <br> O'Sullivan ha conseguido 15 tacadas máximas. O'Sullivan es considerado por muchos fans, críticos y compañeros de profesión, incluyendo Hendry y Steve Davis, como el jugador con más talento que ha dado este deporte. <br> Su altísimo nivel de juego es incomparable en la historia del snooker aunque su temperamento demuestra a veces en él una falta de confianza o interés. También ha estado involucrado en varios incidentes polémicos en su carrera. <br><b> Es el actual número 1 del ranking mundial.</b>", "date":"August 2019"},
                    {"id": 3, "title":"¿Por qué código abierto?", "subTitle":"Es este el camino a seguir", "reference":"Artículo por Brian", "picTwo":"opensourceTwo.jpg", "pic":"opensource.jpg", "content":"<b> Descargo de responsabilidad: </b> Mi opinión es que si la tecnología de código abierto no existiera, la población de programadores sería la mitad de lo que somos hoy. <br> El código abierto llegó en un momento en que entró en juego la necesidad de más soluciones tecnológicas. Desde dispositivos móviles hasta robots. <br> A principios del siglo XXI, los materiales de programación eran muy caros. Para convertirte en un programador, tenías que comprar una computadora, pagar el software de computadora destinado a ejecutar la computadora, pagar el software de programación, comprar libros enormes e incluso a veces pagar tutores de codificación. Hoy en día todo lo que necesita es una computadora y conectividad a Internet. <br> Según yo, Internet es una herramienta de código abierto, aunque de una manera un poco compleja. ¿Por qué? Puede usar la herramienta sin tener que comprarla y tiene la plataforma para mejorarla si es posible. Las herramientas de código abierto han dado como resultado una mayor colaboración al encontrar soluciones. La calidad del producto final mejora con el tiempo. Compartir código también ha mejorado la calidad del código. Con GIT en juego, cada programador quiere compartir la plataforma. <br> Un gran número de empresas prefieren implementar el sistema Linux que Windows, ¿por qué? La tecnología de código abierto no es propensa a ataques de piratería importantes en comparación con el código propietario. Esto se debe al hecho de que hay tantas versiones de una herramienta de código abierto en particular que se actualizan casi a diario, lo que dificulta que cualquier hacker pueda seguir el ritmo. <br> Para que cualquier herramienta de código abierto se considere estándar, entonces tiene que haber una comunidad detrás que mantenga el código regularmente.", "date":"August 2019"},
                    {"id": 4, "title":"SDMX", "subTitle":"Big data es actualmente la gran cosa", "reference":"Artículo por Brian", "picTwo":"sdmxTwo.jpg", "pic":"sdmx.jpg", "content":"Big data es un cambio de enfoque en el mundo de la tecnología. En aquellos días, el enfoque no estaba en los datos sino en la funcionalidad de un sistema y la comunicación. Hoy en día, cualquier empresa grande o pequeña se centra en manipular los datos disponibles para ofrecer mejores soluciones. <br> Cuanto más datos, más precisa es la solución a un problema determinado. Esta colección de grandes conjuntos de datos trajo la esencia de compartir información entre empresas. <br> Ejemplo; A Facebook le gustaría saber cuántos países tienen conectividad a Internet. En lugar de realizar la encuesta ellos mismos, pueden tomar datos de una empresa que ya ha realizado esa encuesta y utilizarlos para cumplir sus objetivos. <br> Este intercambio de datos resultó en dos formatos de datos principales llamados JSON y XML. Cualquier compañía puede usar cualquiera de los dos, pero el problema es que la estructura de datos será diferente para cada compañía. <br> Esto no es eficiente si desea obtener información de más de 10 países, ya que debe estudiar su estructura antes de implementar cada uno diferente, de ahí la necesidad de una estructura estándar y eso es SDMX. <br> Hace 20 años que existe, pero recientemente está ganando impulso debido a su demanda. Cualquier científico de datos que quiera ser relevante en los próximos 15 años debe poder usar SDMX.", "date":"August 2019"},
                    {"id": 5, "title":"Warren Buffet", "subTitle":"El mejor generador de dinero del mundo.", "reference":"Artículo por Brian", "picTwo":"warrenTwo.jpg", "pic":"warrenbuffet.jpg", "content":"Lo considero el mejor generador de dinero del mundo. Comenzó pequeño en los años 80 al apostar su dinero en las llamadas pequeñas empresas en ese momento.<br> Hoy en día, esas pequeñas empresas son compañías de miles de millones de dólares en el mundo que incluyen Coca-Cola, American Airlines, MasterCard, Amazon, Visa, Wells Fargo, Verizon, Delta Airlines y Phillips, entre muchas otras. Su nivel de vida no ha cambiado. <br>El mismo auto viejo, la misma casa de 5 dormitorios que compró en 1956, sin guardaespaldas y una pequeña oficina dentro de su casa. Su fuente de riqueza es el resultado del riesgo que asumió al confiar en que el futuro mejorará. <br>De hecho, hoy puede sonreír. Recientemente, cuando lo interrogaron, dijo que lamenta no haber comenzado a invertir antes de lo que comenzó. Sin embargo, es curioso porque comenzó a los 11 años comprando acciones e incluso ganando más que la mayoría de sus maestros en ese momento.<br> Fue rechazado por Harvard Business School debido a su apariencia en ese momento y no en función de su capacidad mental. Su ídolo era Benjamin Graham, pero Graham rechazó darle un trabajo a Warren porque Warren no era judío. <br>Finalmente, una cosa fascinante de él es que ha escapado de la tecnología toda su vida. Él ha enviado solo un correo electrónico a un Jeff Raikes de Microsoft. Su oficina no tiene computadora y prefiere leer libros antes que mirar una computadora.", "date":"August 2019"},
                    {"id": 6, "title":"OOP vs Funcional vs Procesal", "subTitle":"Cada codificador debe conocer estos conceptos", "reference":"Artículo por Brian", "picTwo":"oopTwo.jpg", "pic":"oop2.jpg", "content":"Son conceptos de los que hablará todo programador. Han estado allí por bastante tiempo. Todo con una opinión diferente sobre cuál es el mejor concepto para usar. Cada opinión es válida según el objetivo a alcanzar. <br> La conclusión es que, entre los tres que tiene que usar al menos uno de ellos para crear un sistema, no importa el lenguaje de programación que vaya a usar. Sí, estos son conceptos pero más de estructura de código. <br> ¿Por qué son importantes? Proporcionan un flujo claro de cómo se han integrado los componentes del sistema en el código para permitir la suma, resta o depuración de entidades del sistema. <br> JavaScript se considera el lenguaje más fácil de aprender porque puede implementar cualquiera de los conceptos sin problemas. Es por eso que se conoce como un lenguaje agnóstico. Los lenguajes de programación orientados a objetos incluyen Java, C ++, Python y Visual Basic, entre otros. <br> Todos estos enfoques tienen sus propias ventajas y desventajas basadas en la encapsulación, la complejidad del código, el polimorfismo, la herencia y la abstracción. <br> Al desarrollar soluciones, la integración de estos conceptos se puede hacer pero con precaución, por lo tanto, corresponde al programador con la estructura de código más comprensible y eficiente de depuración.", "date":"August 2019"},
                    {"id": 7, "title":"Didier Drogba", "subTitle":"¿Quién es él?", "reference":"Artículo por Brian", "picTwo":"didierTwo.jpg", "pic":"didierdrogba.jpg", "content":"Nacido el 11 de marzo de 1978, lo considero uno de mis mejores jugadores personales que he visto jugar. La primera vez que lo conocí fue en mi escuela primaria inferior. <br> Cuando anotó en el juego final del título del Chelsea en 2005, al día siguiente en la escuela les conté a mis amigos sobre él, pero como no podía recordar su nombre, me referí a él como Dragón. <br> Ese nombre se quedó. durante aproximadamente una semana hasta que leí el boletín del domingo y su nombre quedó claro. Drogba Didier, camiseta número 11 (DD11). Mourinho lo consideraba como su hijo. No puedo olvidar cuando Rafael Benítez (entrenador del Liverpool en ese momento) habló mal de Didier Drogba. <br> El siguiente partido contra el Liverpool, Drogba anotó un hat-trick, cerrando la boca. Fue una bestia contra el Arsenal (12 apariciones, 13 goles, 4 asistencias). <br> Mourinho dijo una vez, si tienes a Drogba en tu equipo como entrenador, puedes empacar el autobús y dejar a Drogba para pelear solo con los defensores oponentes. Cualquier pequeño giro con el balón es una posibilidad de media puntuación para él. <br> Una última cosa, mi madre apoya a Chelsea porque Drogba. Ese es el único jugador que ella conoce. Ella ni siquiera sabe que él se retiró jajaja.", "date":"August 2019"}
                ]
            }
        ],
        "fr": [
            {
                "post":[
                    {"id": 1, "title":"MH370: Où es-tu?", "subTitle":"L'un des plus grands mystères du monde aérien", "reference":"Wikipedia", "picTwo":"mh370bTwo.jpg", "pic":"mh370b.jpg", "content":"Le vol 370 Malaysia Airlines (code AITA : MH370) est un vol international régulier de la compagnie aérienne Malaysia Airlines reliant Kuala Lumpur à Pékin. L'appareil, un Boeing 777-200ER qui transportait 239 personnes dont une majorité de ressortissants chinois, est porté disparu depuis le 8 mars 2014. <brr> Selon les autorités malaisiennes, l'appareil s'est accidentellement abîmé dans le sud de l'océan Indien, où il a été détecté pour la dernière fois par des satellites. Les enquêteurs ne privilégient à ce jour aucune hypothèse pour expliquer un tel écart du plan de vol initial. Il s'agit, à ce jour, du plus grand mystère de l'histoire de l'aviation civile. <br> Le seul autre cas d'un avion disparu avec plus de cent personnes à bord est celui d'un appareil de la compagnie Flying Tiger Line, disparu entre l'île de Guam et les Philippines en 1962. <br> Le 30 juillet 2018, le ministère malaisien des Transports émet le rapport final sur la disparition qui synthétise les éléments de recherche sans conclure sur la cause de la disparition. <br> Le 8 mars 2014 à 0 h 41, le Boeing 777 de Malaysia Airlines décolle de l'aéroport international de Kuala Lumpur (code AITA: KUL) à destination de Pékin, avec à son bord deux cent vingt-sept passagers et douze membres d'équipage. Trente-huit minutes après son décollage, l'avion quitte l'espace aérien malaisien. Au contrôleur aérien du centre en route de Kuala Lumpur qui le transfère au centre de Ho Chi Minh Ville, le copilote, croyait-on d'abord, envoie la dernière communication radio « Good night, Malaysia 370 » (« Bonne nuit, Malaysia 370 ») à 1 h 19 le 8 mars (heure de la Malaisie). Fin juin 2014, les médias annoncent qu'il s'agissait plutôt du commandant Zaharie Ahmad Shah, aux dires de son épouse et d'autres membres de sa famille.<br> Le transpondeur est coupé peu après et l'appareil disparaît des écrans radars vietnamiens. Plusieurs tentatives de contact restent vaines, sauf une, embrouillée et brève, faite par le pilote d'un avion à proximité. Une heure après l'arrivée théorique de l'appareil à Pékin, Malaysia Airlines annonce la disparition de l'avion. Selon l'amiral Ngo Van Phat de la Marine populaire vietnamienne, cette dernière a perdu le contact radar avec l'appareil à « environ 153 milles marins (300 km) » au sud des îles Thổ Chu, dans le golfe de Thaïlande. Le site d'informations en ligne Vietnam Express affirme que les autorités ont capté le signal de l'une des balises de détresse de l'avion. <br> En l'absence de signal de détresse ou d'autres indications signalant un problème, la thèse de la désintégration brutale de l'appareil est privilégiée par les enquêteurs, les autorités évoquant une piste terroriste. Cette piste est renforcée le lendemain de la disparition par la découverte de l'utilisation de passeports volés, entraînant l'ouverture d'une enquête pour terrorisme. <br> Identifiés quelques jours plus tard par Interpol et les polices thaïlandaise et malaisienne, les passagers voyageant avec ces passeports ne seraient liés à aucun groupe terroriste.", "date":"August 2019"},
                    {"id": 2, "title":"M. Snooker", "subTitle":"Ronnie O'Sullivan le GOAT", "reference":"Wikipedia", "picTwo":"ronnieTwo.jpg", "pic":"ronnie.jpg", "content":"Ronald Antonio « Ronnie » O'Sullivan est un joueur professionnel anglais de snooker, de billard et un écrivain né le 5 décembre 1975. Son jeu rapide lui a valu le surnom de « The Rocket » (la fusée en anglais).<br>Il a été champion du monde à 5 reprises (2001, 2004, 2008, 2012 et 2013). Il détient le record au classement des gains acquis lors de ses tournois (32 victoires en tournois ranking), remportant plus de 9 millions de livres.<br> Il est considéré par certains de ses pairs et par les fans de snooker comme le joueur le plus talentueux de l'histoire de ce sport. Considéré comme perfectionniste, O'Sullivan avoue souffrir de dépressions et de dépendances.<br>Son autre particularité, en plus d'être un joueur « rapide », est d'être parfaitement ambidextre : il est tout à fait capable de jouer au meilleur niveau mondial tant de la main droite que de la main gauche. Le club où s'entraîne O'Sullivan est le Grove Snooker Centre à Romford dans l'est de Londres.", "date":"August 2019"},
                    {"id": 3, "title":"Pourquoi ouvrir source?", "subTitle":"Est-ce la voie à suivre", "reference":"Article par Brian", "picTwo":"opensourceTwo.jpg", "pic":"opensource.jpg", "content":"<b> Clause de non-responsabilité: </b> À mon avis, si la technologie à source ouverte n’existait pas, la population de programmeurs représenterait la moitié de ce que nous sommes aujourd’hui. <br> L'open source est arrivé à un moment où le besoin de solutions plus technologiques est apparu. Des gadgets mobiles aux robots. <br> Au début du 21ème siècle, les matériaux de programmation étaient si coûteux. Pour devenir programmeur, il fallait acheter un ordinateur, payer pour un logiciel destiné à faire fonctionner l'ordinateur, payer pour le logiciel de programmation, acheter d'énormes livres et parfois même payer des tuteurs de codage. De nos jours, tout ce dont vous avez besoin est un ordinateur et une connexion Internet. <br> Selon moi, Internet est un outil open source, bien que complexe. Pourquoi? Vous pouvez utiliser l'outil sans avoir à l'acheter et vous avez la plate-forme pour l'améliorer s'il est capable. <br> Les outils Open Source ont permis une plus grande collaboration lors de la création de solutions. La qualité du produit final devient de mieux en mieux avec le temps. Le partage de code a également amélioré la qualité du code. Avec GIT en jeu, chaque programmeur veut une part de la plate-forme. <br> Un assez grand nombre d'entreprises préfèrent implémenter le système Linux que Windows, pourquoi? <br> La technologie open source n'est pas sujette aux attaques de piratage majeures par rapport au code propriétaire. Cela est dû au fait qu'il existe de nombreuses versions d'un outil open source particulier qui sont mises à jour presque quotidiennement, ce qui empêche tout pirate informatique de suivre le rythme. <br> Pour qu'un outil open source soit considéré comme conforme aux normes, il doit exister une communauté derrière lui qui maintiendra le code régulièrement.", "date":"August 2019"},
                    {"id": 4, "title":"SDMX", "subTitle":"Le big data est actuellement le gros truc", "reference":"Article par Brian", "picTwo":"sdmxTwo.jpg", "pic":"sdmx.jpg", "content":"Le Big Data est un changement d'orientation dans le monde de la technologie. À l'époque, l'accent n'était pas mis sur les données, mais sur la fonctionnalité d'un système et la communication. De nos jours, toutes les entreprises, grandes ou petites, se concentrent sur la manipulation des données disponibles pour offrir de meilleures solutions. <br> Plus les données sont nombreuses, plus la solution à un problème donné est précise. Cette collection de grands ensembles de données a été l’essentiel du partage d’informations entre entreprises. <br> Exemple; Facebook aimerait savoir combien de pays ont une connectivité Internet. Au lieu de mener l'enquête eux-mêmes, ils peuvent utiliser les données d'une entreprise qui l'a déjà réalisée et les utiliser pour atteindre leurs objectifs. <br> Ce partage de données a résulté en deux formats de données principaux appelés JSON et XML. N'importe quelle entreprise peut utiliser l'une ou l'autre, mais le problème est que la structure de données sera différente pour chaque entreprise. <br> Cela n’est pas efficace si vous souhaitez obtenir des informations de plus de 10 pays, car vous devez étudier leur structure avant de les mettre en œuvre de manière différente, d’où la nécessité d’une structure standard: SDMX. <br> Cela existe depuis environ 20 ans maintenant, mais récemment, il prend de l'ampleur en raison de sa demande. Tout informaticien qui souhaite être pertinent au cours des 15 prochaines années doit pouvoir utiliser SDMX.", "date":"August 2019"},
                    {"id": 5, "title":"Warren Buffet", "subTitle":"Meilleur générateur d'argent au monde", "reference":"Article par Brian", "picTwo":"warrenTwo.jpg", "pic":"warrenbuffet.jpg", "content":"Je le considère comme le meilleur fabricant d'argent au monde. Il a commencé petit dans les années 80 en misant son argent sur les soi-disant petites entreprises de l'époque. Aujourd'hui, ces petites entreprises sont des milliards de dollars dans le monde, parmi lesquelles Coca-Cola, American Airlines, MasterCard, Amazon, Visa, Wells Fargo, Verizon, Delta Airlines et Phillips. <br> Son niveau de vie n'a pas changé. Même vieille voiture, même vieille maison de 5 chambres achetée en 1956, pas de garde du corps et petit bureau à l'intérieur de sa maison. Sa source de richesse est le résultat du risque qu'il a pris de faire en sorte que l'avenir s'améliore.<br> En effet, aujourd'hui, il peut sourire. Récemment interrogé, il a regretté de ne pas avoir commencé à investir plus tôt que prévu. C'est drôle, car il a commencé dès 11 ans en achetant des actions et même en gagnant plus que la plupart de ses professeurs à l'époque.<br> Il a été rejeté par la Harvard Business School en raison de son apparence à l'époque et non sur la base de ses capacités intellectuelles. Son idole était Benjamin Graham, mais Graham refusa de donner un emploi à Warren car ce dernier n’était pas juif. <br>Enfin, une chose fascinante à son sujet est qu’il a échappé à la technologie toute sa vie. Il n'a envoyé qu'un seul courrier électronique à Jeff Raikes de Microsoft. Son bureau n’a pas d’ordinateur et il préfère continuer à lire des livres que de regarder un ordinateur.", "date":"August 2019"},
                    {"id": 6, "title":"OOP vs Fonctionnel vs De procédure", "subTitle":"Chaque codeur doit connaître ces concepts", "reference":"Article par Brian", "picTwo":"oopTwo.jpg", "pic":"oop2.jpg", "content":"Ce sont des concepts dont tous les programmeurs vont parler. Ils sont là depuis assez longtemps. Tous avec une opinion différente sur quel est le meilleur concept à utiliser. Chaque avis est valable en fonction du but à atteindre. <br> En résumé, parmi les trois, vous devez utiliser au moins l'un d'entre eux pour créer un système, peu importe le langage de programmation que vous allez utiliser. Oui ce sont des concepts mais plus de structure de code. <br> Pourquoi sont-ils importants? Ils indiquent clairement comment les composants du système ont été intégrés dans le code pour permettre l’addition, la soustraction ou le débogage d’entités système. <br> JavaScript est considéré comme le langage le plus facile à apprendre car vous pouvez implémenter l'un ou l'autre des concepts sans aucun problème. C’est pourquoi on parle de langage agnostique. Les langages de programmation orientés objet incluent Java, C ++, Python et Visual Basic, entre autres. <br> Toutes ces approches ont leurs propres avantages et inconvénients basés sur l'encapsulation, la complexité du code, le polymorphisme, l'héritage et l'abstraction. <br> Lors du développement de solutions, l'intégration de ces concepts peut être faite, mais avec prudence, il appartient au programmeur de se positionner avec la structure de code la plus compréhensible et la plus débugable.", "date":"August 2019"},
                    {"id": 7, "title":"Didier Drogba", "subTitle":"Qui est-il?", "reference":"Article par Brian", "picTwo":"didierTwo.jpg", "pic":"didierdrogba.jpg", "content":"Né le 11 mars 1978, je le considère comme l’un de mes meilleurs joueurs personnels que j’ai jamais regardé jouer. La première fois que je l'ai connu, c'était dans mon école primaire inférieure. <br> Quand il a marqué en finale du titre vainqueur en Chelsea en 2005, le lendemain à l'école, j'ai parlé de lui à mes amis, mais comme je ne me souvenais pas de son nom, je l'ai appelé Dragon. <br> Ce nom est resté. environ une semaine avant de lire la gazette du dimanche et de préciser son nom. Drogba Didier, maillot numéro 11 (DD11). Mourinho le considérait comme son fils. Je ne peux pas oublier que Rafael Benitez (l’entraîneur de Liverpool à l’époque) parlait mal de Didier Drogba. <br> Lors du match suivant contre Liverpool, Drogba a inscrit un tour du chapeau qui a fermé la bouche. Il était une bête contre Arsenal (12 apparitions, 13 buts, 4 passes décisives). <br> Mourinho a dit un jour que si Drogba faisait partie de votre équipe en tant qu'entraîneur, vous pouvez préparer le bus et laisser Drogba se battre seul contre les défenseurs adverses. N'importe quel léger tour avec le ballon lui donne une chance sur deux. <br> Une dernière chose, ma mère soutient Chelsea coz de Drogba. C’est le seul joueur qu’elle connaisse. Elle ne sait même pas qu'il a pris sa retraite, hahaha.", "date":"August 2019"}
                 ]
            }
        ],
        "swa": [
            {
                "post":[
                    {"id": 1, "title":"MH370: Uko wapi?", "subTitle":"Moja ya siri kubwa katika ulimwengu wa ndege", "reference":"Wikipedia", "picTwo":"mh370bTwo.jpg", "pic":"mh370b.jpg", "content":"Malaysia Airlines MH370 ilikuwa kitambulisho cha njia iliyopangwa na ya kimataifa ya abiria kati ya Kuala Lumpur , Malaysia , na Beijing , China . Njia hiyo inaendeshwa na Malaysia Airlines ambayo, tangu Machi 14, 2014, imebadilisha kitambulisho chako cha Malaysia Airlines MH318. <br> Katika masaa ya mapema ya Machi 8, 2014, wakati wa ndani (mwishoni mwa Machi 7, wakati wa UTC ), ndege iliyokuwa imebeba njia hii iliyobeba abiria 227 na wafanyakazi wa kikundi 12 ilitoweka kutoka rada baada ya takriban saa moja ya kukimbia wakati ikiruka juu ya Ghuba ya Thailand katika Bahari ya Uchina . <br> Hadi wachunguzi wa rada watoweke, wafanyakazi walikuwa wameripoti kutokuwa na usawa na ndege hiyo. Mfumo wa ndege wa ACARS pia haukutuma ujumbe wa satelaiti, ambao unapaswa kutokea otomatiki ikiwa utashindwa. <br> Mnamo Machi 24, 2014, serikali ya Malaysia ilitangaza rasmi kwamba ndege hiyo iliangukia Bahari ya Hindi bila kuwaacha waokoaji yoyote. Kulingana na rekodi za satelaiti, ndege hiyo iliruka kwa masaa kadhaa baada ya kutoweka kutoka rada hadi ikamalizika na mafuta, na mifumo yake yote ya mawasiliano imeshindwa. <br> Hata baada ya miaka mitatu ya utafutaji wa kina, ukiongozwa na serikali za Australia , Malaysia na Uchinakutoka 2014 hadi 2017 , mabaki ya ndege haikuwahi kupatikana, na kuifanya iwe moja ya siri kubwa za anga za kisasa za raia.", "date":"August 2019"},
                    {"id": 2, "title":"Bwana Snooker", "subTitle":"Ronnie O'Sullivan ndiye GOAT", "reference":"Wikipedia", "picTwo":"ronnieTwo.jpg", "pic":"ronnie.jpg", "content":"Ronald Antonio O'Sullivan OBE (amezaliwa 5 Desemba 1975) ni mcheza taaluma hodari wa Kiingereza ambaye anachukuliwa sana kama mmoja wa wachezaji wakubwa katika historia ya mchezo huo.<br> Ameshinda Mashindano matano ya Dunia, rekodi saba za Wamiliki saba, na rekodi saba za ubingwa wa Uingereza, akiweka rekodi ya jumla ya majina 19 katika mashindano ya Triple Crown.<br> Aliposhinda Mashindano ya Uingereza ya 1993 akiwa na umri wa miaka 17 na siku 358, alikuwa mchezaji mdogo kabisa aliyewahi kushinda taji la juu; sasa anashiriki rekodi ya majina ya nafasi kubwa (36) na Stephen Hendry. Yeye pia ndiye mshindi wa mwisho wa mashindano ya Masters, akishinda hafla ya 1995 mwenye umri wa miaka 19. <br>Tuzo ya kazi yake ya pesa zaidi ya Pauni milioni 10 ni kiwango cha juu kabisa kinachopatikana na mchezaji yeyote kwenye historia ya snooker.<br> Muundaji mzuri wa mapumziko, anashikilia rekodi ya mapumziko ya karne nyingi katika mashindano ya kitaaluma, na ndiye mchezaji pekee aliyewahi kupata mafanikio ya miaka 1,000. Yeye pia anashikilia rekodi ya idadi kubwa zaidi ya mapumziko yaliyotambuliwa rasmi katika mashindano ya kitaaluma (15), na kwa mapumziko ya haraka sana ya ushindani, yaliyoandaliwa kwa wakati wa dakika 5 na sekunde 8 kwenye Mashindano ya Dunia ya 1997.<br>O'Sullivan mara nyingi amekuwa mzozo katika michezo, aliyejulikana kwa hasira yake isiyotabirika na mapigano yake na pombe, dawa za kulevya, na unyogovu, na amepokea onyo nyingi na vikwazo kutoka kwa baraza kuu la michezo juu ya mwenendo wake na maoni.<br> Alichukua mapumziko ya muda mrefu kutoka kwenye mchezo huo katika msimu wa 2012/2013 na ameonyesha kurudia nia yake ya kustaafu. Mwishoni mwa mwaka wa 2018, alitishia kuunda safari ya kutazama snooker.<br> Kando na kazi yake ya kucheza, amefanya kazi kama pundit ya utapeli wa sosi ya Eurosport, ameandika riwaya za uhalifu na picha za watu wengine, na amekuwa na nyota katika minara ya watendaji wa Ronnie O'Sullivan's American Hustle. Alitunukiwa OBE katika Heshima ya Mwaka Mpya wa 2016.", "date":"August 2019"},
                    {"id": 3, "title":"Kwa nini chanzo wazi?", "subTitle":"Je! Hii ndio njia ya kwenda", "reference":"Nakala ya Brian", "picTwo":"opensourceTwo.jpg", "pic":"opensource.jpg", "content":"<b> Kanusho: </b> Maoni yangu ni, ikiwa teknolojia ya chanzo-msingi haikuwepo, idadi ya waandaaji itakuwa nusu ya tulivyo leo. <br> Chanzo wazi kilikuja wakati wakati hitaji la suluhisho zaidi za kiteknolojia lilitekelezwa. Kutoka kwa vidude vya rununu hadi roboti. <br> Nyuma katika vifaa vya mapema vya karne ya 21 zilikuwa ghali sana. Ili uwe programu ya programu ulilazimika kununua kompyuta, kulipia programu ya kompyuta ilimaanisha kuendesha kompyuta, kulipia programu ya programu, kununua vitabu vikubwa na hata wakati mwingine hulipa wafundishaji wa uandishi. Siku hizi unahitaji tu ni muunganisho wa kompyuta na mtandao. <br> Kulingana na mimi mtandao ni zana wazi chanzo ingawa kwa njia ngumu. Kwa nini? Unaweza kutumia zana bila kuinunua na unayo jukwaa la kuiboresha ikiwa ina uwezo. <br> Zana za chanzo wazi zimesababisha ushirikiano zaidi wakati wa kupata suluhisho. Ubora wa bidhaa ya mwisho inakuwa bora na bora na wakati. Kushiriki kwa nambari pia kumeboresha nambari ya nambari. Na GIT kucheza, kila programu inataka kushiriki kwenye jukwaa. Je! idadi kubwa ya kampuni ingeamua kutekeleza mfumo wa Linux kuliko Windows, kwa nini? <br> Teknolojia ya chanzo wazi haijakabiliwa na mashambulio makubwa ya utapeli kwa kulinganisha na kanuni za wamiliki. Hii ni kwa sababu ya ukweli kwamba kuna matoleo mengi sana ya zana moja ya chanzo wazi ambayo huendelea kusasishwa karibu kila siku, ambayo inafanya kuwa ngumu kwa walaji yoyote kuendelea na kasi. <br> Ili zana yoyote ya chanzo wazi kuzingatiwa kwa kiwango, basi lazima kuwe na jamii nyuma yake ambayo itadumisha msimbo mara kwa mara.", "date":"August 2019"},
                    {"id": 4, "title":"SDMX", "subTitle":"Takwimu kubwa kwa sasa ndio jambo kubwa", "reference":"Nakala ya Brian", "picTwo":"sdmxTwo.jpg", "pic":"sdmx.jpg", "content":"Takwimu kubwa ni mabadiliko ya mtazamo katika ulimwengu wa teknolojia. Hapo nyuma siku za kuzingatia hazikuwa kwenye data badala ya utendaji wa mfumo na mawasiliano. Siku hizi kampuni yoyote kubwa au ndogo inajikita katika kudanganya data inayopatikana ili kutoa suluhisho bora. <br> data zaidi, suluhisho sahihi zaidi ni kwa shida fulani. Mkusanyiko huu wa hifadhidata kubwa umeleta kiini cha kugawana habari kati ya kampuni. <br> Mfano; Facebook ingependa kujua ni nchi ngapi zina kuunganishwa kwa mtandao. Badala ya kufanya uchunguzi wenyewe, wanaweza kuchukua data kutoka kwa kampuni ambayo tayari imefanya utafiti huo na kuitumia kufikia malengo yao. <br> Kushiriki kwa data hii kumesababisha fomati mbili kuu za data iitwayo JSON na XML. Kampuni yoyote inaweza kutumia ama lakini shida ni kwamba muundo wa data utakuwa tofauti kwa kila kampuni. <br> Hii haifai ikiwa unataka kupata habari kutoka nchi zaidi ya 10 kwani lazima ujifunze muundo wao kabla ya kutekeleza kila tofauti, kwa hivyo hitaji la muundo wa kawaida na hiyo ni SDMX. <br> Imekuwepo kwa karibu miaka 20 sasa lakini hivi karibuni inaongezeka kwa kasi kutokana na mahitaji yake. Mwanasayansi yeyote wa data ambaye anataka kuwa muhimu katika miaka 15 ijayo lazima awe na uwezo wa kutumia SDMX.", "date":"August 2019"},
                    {"id": 5, "title":"Warren Buffet", "subTitle":"Mtengenezaji bora wa pesa ulimwenguni", "reference":"Nakala ya Brian", "picTwo":"warrenTwo.jpg", "pic":"warrenbuffet.jpg", "content":"Ninamwona kama mpiga pesa bora ulimwenguni. Alianza ndogo katika miaka ya 80 kwa kuweka pesa zake kwenye kampuni hizo zilizoitwa nyakati hizo wakati huo. <br>Leo kampuni hizo ndogo ni kampuni za dola bilioni ulimwenguni ambazo ni pamoja na Coca-Cola, mashirika ya ndege ya Amerika, MasterCard, Amazon, Visa, Wells Fargo, Verizon, Delta Airlines na Phillips kati ya wengine wengi. <br>Kiwango chake cha maisha hakijabadilika. Gari moja la zamani, nyumba ileile ya chumba cha kulala 5 alichoinunua mnamo 1956, hakuna walinzi na ofisi ndogo ndani ya nyumba yake. Chanzo chake cha utajiri ni kama matokeo ya hatari aliyachukua kwa kuamini siku zijazo zitakuwa bora. Hakika leo anaweza kutabasamu.<br> Hivi majuzi alipohojiwa alisema kuwa anajuta kutoanza kuwekeza wakati wa mapema kuliko vile alivyokuwa akianza. Jambo la kupendeza ingawa kwa sababu alianza mapema kama umri wa miaka 11 kwa kununua hisa na hata kupata zaidi ya walimu wake wengi wakati huo.<br> Alikataliwa na Shule ya Biashara ya Harvard kutokana na muonekano wake wakati huo na sio kwa msingi wa uwezo wake wa akili. Sanamu yake alikuwa Benjamin Graham, lakini Graham alikataa kumpa kazi Warren kwa sababu Warren hakuwa Myahudi. <br>Mwishowe jambo moja la kufurahisha juu yake ni kwamba ametoroka teknolojia maisha yake yote. Ametuma barua pepe moja tu kwa Jeff Raikes mmoja wa Microsoft. Ofisi yake haina kompyuta na angetaka kuendelea kusoma vitabu kuliko kutazama kwenye kompyuta.", "date":"August 2019"},
                    {"id": 6, "title":"OOP vs Operesheni vs Utaratibu", "subTitle":"Kila mtunzi lazima ajue dhana hizi", "reference":"Nakala ya Brian", "picTwo":"oopTwo.jpg", "pic":"oop2.jpg", "content":"Ni dhana kila msanii wa kuprogramu atazungumza kuhusu. Zimekuwa kwa muda mrefu sana. Kila mtu ana maoni tofauti juu ya ambayo ni wazo bora kutumia. Kila maoni ni halali kulingana na lengo linalokusudiwa. <br> Line ya chini ni kwamba, kati ya hizo tatu lazima utumie angalau mmoja, haijalishi lugha ya programu utakayotumia. Ndio hizi ni dhana lakini zaidi ya muundo wa kificho. Kwa nini ni muhimu? Wanatoa mtiririko wazi wa jinsi vifaa vya mfumo vimejumuishwa kwenye msimbo ili kuruhusu kuongezewa, kuondoa au kurekebisha vyombo vya mfumo. <br> JavaScript inachukuliwa kuwa lugha rahisi zaidi kujifunza kwa sababu unaweza kutekeleza dhana yoyote bila shida yoyote. Ndio maana hurejelewa kama lugha isiyo ya kawaida. Lugha ya Programu ya Kusudi inayojumuisha ni pamoja na Java, C ++, Python na Visual Basic kati ya wengine. <br> Njia hizi zote zina faida na hasara zao kulingana na usimbuaji, ugumu wa nambari, upolimishaji, urithi na uboreshaji. <br> Wakati wa kuunda suluhisho la dhana, hili linaweza kufanywa lakini kwa tahadhari kwa hivyo ni juu ya msanii wa kuprogramu aje na program iliyo na muundo wa kificho unaoeleweka zaidi na unasababisha ufanisi zaidi.", "date":"August 2019"},
                    {"id": 7, "title":"Didier Drogba", "subTitle":"Yeye ni nani?", "reference":"Nakala ya Brian", "picTwo":"didierTwo.jpg", "pic":"didierdrogba.jpg", "content":"Alizaliwa mnamo Machi 11 1978, nikamwona kama mmoja wa wachezaji wangu bora ambao nimewahi kuwatazama wakicheza. Mara ya kwanza kumjua alikuwa amerudi katika shule yangu ya msingi ya chini. <br> Alipofunga katika fainali ya kushinda taji ya Premier akichezea Chelsea mwaka 2005, siku iliyofuata shuleni niliwaambia marafiki wangu juu yake, lakini kwa sababu sikuweza kukumbuka jina lake, nilimtaja kama Dragon. kwa karibu wiki moja hadi nikasoma gazeti la Jumapili na jina lake likawa wazi. Drogba Didier, shati namba 11 (DD11). Mourinho alimchukulia kama mtoto wake. Siwezi kusahau wakati Rafael Benitez (Kocha wa Liverpool wakati huo) alizungumza vibaya na Didier Drogba. <br> Mchezo uliofuata dhidi ya Liverpool, Drogba alifunga hatamu, akafunga mdomo. Alikuwa mnyama dhidi ya Arsenal (muonekano 12, malengo 13, misaada 4). <br> Mourinho aliwahi kusema, ikiwa una Drogba katika timu yako kama kocha, unaweza kupakia basi na kumuacha Drogba kupigana na watetezi wa wapinzani peke yake. Zamu yoyote kidogo na mpira ni nafasi ya kufunga bao.<br> Mamangu ni shabiki wa Chelsea lakini kwa sababu tu ya Didier Drogba Ni mchezaji tu yeye anajua. Hajui hata alistaafu hahaha.", "date":"August 2019"}
                 ]
            }
        ],
        "port": [
            {
                "post":[
                    {"id": 1, "title":"MH370: Onde está voce?", "subTitle":"Um dos maiores mistérios do mundo dos vôos", "reference":"Wikipedia", "picTwo":"mh370bTwo.jpg", "pic":"mh370b.jpg", "content":"Malaysia Airlines MH370 foi a identificação da rota aérea de passageiros regular e internacional entre Kuala Lumpur, na Malásia, e Pequim, na China. A rota é operada pela companhia aérea Malaysia Airlines que, a partir de 14 de março de 2014, substituiu sua identificação para Malaysia Airlines MH318. <br> Na madrugada de 8 de março de 2014, no horário local (tarde de 7 de março, horário UTC), a aeronave que realizava esta rota levando 227 passageiros e 12 tripulantes, desapareceu dos radares após aproximadamente uma hora de voo enquanto sobrevoava o Golfo da Tailândia, no Mar da China. <br> Até o instante do desaparecimento dos monitores de radar, a tripulação não havia relatado nenhuma anomalia com o voo. O sistema ACARS do avião também não enviou mensagens por satélite, o que deveria ocorrer automaticamente no caso de alguma falha. <br> Em 24 de março de 2014, o governo malaio comunicou oficialmente que o voo caiu no mar no Oceano Índico sem deixar sobreviventes. Segundo registros feitos por satélites, o avião voou por várias horas após desaparecer dos radares, até esgotar o combustível, com todos os seus sistemas de comunicação desativados. Mesmo após três anos de extensas buscas, comandadas pelos governos da Austrália, da Malásia e da China no período de 2014 a 2017. os destroços da aeronave nunca foram localizados, tornando o caso um dos maiores mistérios da aviação civil contemporânea.", "date":"August 2019"},
                    {"id": 2, "title":"Sr. Snooker", "subTitle":"Ronnie O'Sullivan a GOAT", "reference":"Wikipedia", "picTwo":"ronnieTwo.jpg", "pic":"ronnie.jpg", "content":"Ronald Antonio O'Sullivan OBE (nascido em 5 de dezembro de 1975) é um jogador de sinuca profissional inglês que é amplamente considerado como um dos maiores jogadores da história do esporte.<br> Ele ganhou cinco campeonatos mundiais, um recorde de sete títulos de mestrado e um recorde de sete campeonatos do Reino Unido, estabelecendo um total recorde de 19 títulos em torneios Triple Crown. <br>Ao vencer o Campeonato do Reino Unido de 1993 com 17 anos e 358 dias, ele se tornou o jogador mais jovem a ganhar um título no ranking; ele agora compartilha o recorde de títulos com mais ranking (36) com Stephen Hendry. <br>Ele também é o vencedor mais jovem do torneio Masters, vencendo o evento de 1995 com 19 anos de idade. Seu prêmio em dinheiro de mais de 10 milhões de libras é o valor mais alto ganho por qualquer jogador na história da sinuca.<br> Um prolífico construtor de rupturas, ele detém o recorde de mais quebras de século em competições profissionais  e é o único jogador a ter alcançado 1.000 séculos de carreira.<br> Ele também detém os recordes do maior número de quebras máximas oficialmente reconhecidas em competições profissionais (15) e do intervalo máximo competitivo mais rápido, compilado em um tempo de 5 minutos e 8 segundos no Campeonato Mundial de 1997.<br> O'Sullivan tem sido muitas vezes uma figura controversa no esporte, conhecida por seu temperamento imprevisível e suas lutas com álcool, drogas e depressão, e recebeu muitos avisos e sanções do corpo governante do esporte por sua conduta e comentários. <br>Ele fez uma pausa prolongada do esporte durante a temporada 2012/2013 e indicou repetidamente sua intenção de se aposentar. No final de 2018, ele ameaçou formar um tour separatista de sinuca.<br> Fora de sua carreira de jogador, ele trabalhou como especialista na cobertura de sinuca do Eurosport, escreveu romances e autobiografias de crime e atuou na American Hustle, da minissérie Ronnie O'Sullivan. Ele foi premiado com uma EFC no Ano Novo de 2016.", "date":"August 2019"},
                    {"id": 3, "title":"Por que código aberto?", "subTitle":"É este o caminho a percorrer", "reference":"Artigo por Brian", "picTwo":"opensourceTwo.jpg", "pic":"opensource.jpg", "content":"<b> Isenção de responsabilidade: </b> Minha opinião é que, se a tecnologia de código aberto não existisse, a população de programadores seria metade do que somos hoje. <br> O código aberto surgiu no momento em que a necessidade de mais soluções tecnológicas entrou em jogo. De dispositivos móveis a robôs. <br> No início do século XXI, os materiais de programação eram muito caros. Para se tornar um programador, você tinha que comprar um computador, pagar pelo software destinado a executar o computador, pagar pelo software de programação, comprar livros enormes e, às vezes, pagar tutores de codificação. Hoje em dia, tudo o que você precisa é de um computador e conectividade à Internet. <br> De acordo com mim, a Internet é uma ferramenta de código aberto, embora de maneira um pouco complexa. Por quê? Você pode usar a ferramenta sem precisar comprá-la e possui a plataforma para aprimorá-la, se possível. <br> As ferramentas de código aberto resultaram em mais colaboração ao criar soluções. A qualidade do produto final se torna cada vez melhor com o tempo. O compartilhamento de código também melhorou a qualidade do código. Com o GIT em jogo, todo programador deseja uma parte da plataforma. <br> Um grande número de empresas prefere implementar o sistema Linux a Windows, por quê? <br> A tecnologia de código aberto não é propensa a grandes ataques de hackers, em comparação com o código proprietário. Isso se deve ao fato de existirem tantas versões de uma ferramenta de código aberto em particular que se atualizam quase diariamente, o que dificulta qualquer hacker acompanhar o ritmo. <br> Para que qualquer ferramenta de código aberto seja considerada padrão, é necessário que haja uma comunidade por trás dela que manterá o código regularmente.", "date":"August 2019"},
                    {"id": 4, "title":"SDMX", "subTitle":"Atualmente, o big data é a grande coisa", "reference":"Artigo por Brian", "picTwo":"sdmxTwo.jpg", "pic":"sdmx.jpg", "content":"Big data é uma mudança de foco no mundo da tecnologia. Antigamente, o foco não era nos dados, e sim na funcionalidade de um sistema e na comunicação. Atualmente, qualquer empresa grande ou pequena está focada na manipulação de dados disponíveis para oferecer melhores soluções. <br> Quanto mais dados, mais precisa é a solução para um determinado problema. Essa coleção de grandes conjuntos de dados trouxe a essência do compartilhamento de informações entre empresas. <br> Exemplo; O Facebook gostaria de saber quantos países têm conectividade com a Internet. Em vez de fazer a pesquisa eles mesmos, eles podem pegar dados de uma empresa que já fez essa pesquisa e usá-los para atingir seus objetivos. <br> Esse compartilhamento de dados resultou em dois principais formatos de dados, chamados JSON e XML. Qualquer empresa pode usar qualquer um, mas o problema é que a estrutura de dados será diferente para cada empresa. <br> Isso não é eficiente se você deseja obter informações de mais de 10 países, pois deve estudar sua estrutura antes de implementar cada diferente, daí a necessidade de uma estrutura padrão, que é o SDMX. <br> Já existe há cerca de 20 anos, mas recentemente está ganhando força devido à sua demanda. Qualquer cientista de dados que queira ser relevante nos próximos 15 anos deve poder usar o SDMX.", "date":"August 2019"},
                    {"id": 5, "title":"Warren Buffet", "subTitle":"Melhor fabricante de dinheiro do mundo", "reference":"Artigo por Brian", "picTwo":"warrenTwo.jpg", "pic":"warrenbuffet.jpg", "content":"Eu o considero o melhor fazedor de dinheiro do mundo. Ele começou pequeno nos anos 80 apostando seu dinheiro nas chamadas pequenas empresas naquela época.<br> Hoje essas pequenas empresas são bilhões de dólares no mundo, incluindo Coca-Cola, American Airlines, MasterCard, Amazon, Visa, Wells Fargo, Verizon, Delta Airlines e Phillips, entre muitas outras. Seu padrão de vida não mudou. <br>O mesmo carro velho, a mesma casa antiga de 5 quartos que ele comprou em 1956, sem guarda-costas e um pequeno escritório dentro de sua casa. Sua fonte de riqueza é o resultado do risco que ele assumiu em confiar no futuro. De fato, hoje ele pode sorrir.<br> Recentemente, quando interrogado, ele disse que lamenta não ter começado a investir durante o período anterior. O engraçado é que ele começou aos 11 anos comprando ações e até ganhando mais do que a maioria de seus professores na época.<br> Ele foi rejeitado pela Harvard Business School devido à sua aparência na época e não com base em sua capacidade mental. O ídolo dele era Benjamin Graham, mas Graham recusou dar um emprego a Warren porque Warren não era judeu.<br> Finalmente, uma coisa fascinante sobre ele é que ele escapou da tecnologia a vida toda. Ele enviou apenas um email para um Jeff Raikes da Microsoft. O escritório dele não tem computador e ele prefere continuar lendo livros do que olhando para um computador.", "date":"August 2019"},
                    {"id": 6, "title":"OOP vs Funcional vs Processual", "subTitle":"Todo codificador deve conhecer esses conceitos", "reference":"Artigo por Brian", "picTwo":"oopTwo.jpg", "pic":"oop2.jpg", "content":"São conceitos sobre os quais todos os programadores falarão. Eles já estão lá há muito tempo. Tudo com uma opinião diferente sobre qual é o melhor conceito para usar. Cada opinião é válida dependendo do objetivo a ser alcançado. <br> Resumindo, entre os três que você precisa usar pelo menos um deles para criar um sistema, não importa a linguagem de programação que você usará. Sim, esses são conceitos, mas mais da estrutura de código. <br> Por que eles são importantes? Eles fornecem um fluxo claro de como os componentes do sistema foram integrados no código para permitir a adição, subtração ou depuração de entidades do sistema. <br> JavaScript é considerado a linguagem mais fácil de aprender, porque você pode implementar qualquer um dos conceitos sem qualquer aborrecimento. É por isso que é referido como uma linguagem agnóstica. As linguagens de programação orientada a objetos incluem Java, C ++, Python e Visual Basic, entre outros. <br> Todas essas abordagens têm suas próprias vantagens e desvantagens, baseadas no encapsulamento, na complexidade do código, no polimorfismo, na herança e na abstração. <br> Ao desenvolver soluções, a integração desses conceitos pode ser feita, mas com cautela, portanto, cabe ao programador aparecer com a estrutura de código mais compreensível e eficiente de depuração.", "date":"August 2019"},
                    {"id": 7, "title":"Didier Drogba", "subTitle":"Quem é ele?", "reference":"Artigo por Brian", "picTwo":"didierTwo.jpg", "pic":"didierdrogba.jpg", "content":"Nascido em 11 de março de 1978, considero-o um dos meus melhores jogadores pessoais que já assisti jogando. A primeira vez que o conheci estava de volta à minha escola primária. <br> Quando ele marcou no jogo final do título vencedor do Chelsea em 2005, no dia seguinte na escola, contei a meus amigos sobre ele, mas como não conseguia lembrar o nome dele, me referi a ele como Dragon. <br> por cerca de uma semana até eu ler o diário de domingo e seu nome ficar claro. Drogba Didier, camisa número 11 (DD11). Mourinho o considerava filho. Não consigo esquecer quando Rafael Benitez (técnico do Liverpool na época) falou mal de Didier Drogba. <br> No jogo seguinte contra o Liverpool, Drogba marcou um hat-trick, fechando a boca. Ele era um animal contra o Arsenal (12 jogos, 13 gols, 4 assistências). <br> Mourinho disse uma vez: se você tem Drogba em seu time como treinador, pode pegar o ônibus e deixar Drogba para lutar sozinho com os defensores adversários. Qualquer reviravolta leve com a bola é uma chance de meia para ele. <br> Uma última coisa, minha mãe apóia o Chelsea coz de Drogba. Esse é o único jogador que ela conhece. Ela nem sabe que ele se aposentou hahaha.", "date":"August 2019"}
                 ]
            }
        ]
    }
]